Repository: robot-xliff-farmer/bem-method
Catalog: bem-method.tmx
Source language: ru
Languages: en

source: На примере ниже открывающееся всплывающее окно не перекрывает другие блоки, находящиеся на странице. Например, шапка страницы всегда остается на первом плане:
en: The example below demonstrates how a popup does not overlap other blocks on the page. E.g., the page header always stays on the foreground.

source: { block : 'popup', mix : { block : 'z-index-group', mods : { level : 1 } }, content : 'Я блок с { level : 1 }, который находится под блоком с { level : 2 }.' mods : { autoclosable : true, theme : 'normal' }, }
en: { block : 'popup', mix : { block : 'z-index-group', mods : { level : 1 } }, content : 'I am the block with { level : 1 } and I am under the block with { level : 2 }.' mods : { autoclosable : true, theme : 'normal' }, }

source: Используется для создания модального окна.
en: Use this block for creating a modal window.

source: Видимость модального окна.
en: Displaying of the modal window.

source: Автоматическое скрытие модального окна.
en: Autoclosing of the modal window.

source: Уровень слоя модального окна.
en: The level of the modal window layer

source: Выставляется при открытии модального окна.
en: The modifier is set automatically when the modal window is displayed.

source: Отвечает за видимость модального окна на странице.
en: Defines visibility of the popup window.

source: Скрывает блок по клику вне зоны модального окна или по нажатию кнопки Escape.
en: This modifier with the truevalue allows to hide the modal window automatically by clicking outside the modal window area or pressing Escape button.

source: { block : 'modal', mods : { theme : 'islands', autoclosable : true }, content : 'Содержимое модального окна' }
en: { block : 'modal', mods : { theme : 'islands', autoclosable : true }, content : 'Contents of the modal window' }

source: { block : 'modal', mods : { theme : 'islands' }, content : 'Содержимое модального окна' }
en: { block : 'modal', mods : { theme : 'islands' }, content : 'Contents of the modal window' }

source: { block : 'modal', mods : { theme : 'islands' }, content : 'Содержимое модального окна', zIndexGroupLevel : 3 }
en: { block : 'modal', mods : { theme : 'islands' }, content : 'Contents of the modal window', zIndexGroupLevel : 3 }

source: Библиотека блоков, предоставляющая готовые элементы управления форм и некоторые другие блоки. Содержит абстрагированные от дизайна базовые реализации. Возможно опциональное использование тем.
en: A library of blocks that provides ready-made form controls and some other blocks. The library contains base realizations of the blocks that are abstracted from the design. Few optional design themes are available.

source: Состав
en: Structure

source: Оптимизаторы
en: Optomizers

source: Линтеры
en: Linters

source: Автопрефиксер
en: Autoprefixer

source: Принципы разработки библиотеки
en: Development principles

source: Модульное тестирование
en: Modular testing

source: Уровни
en: Levels

source: Применяется во время сборки для генерации вендорных префиксов для поддерживаемых браузеров на основании конфигурации.
en: Use it to generate vendor prefixes for supported browsers based on the configuration.

source: Частичная поддержка Internet Explorer 8 (подробнее)
en: Partially supported of Internet Explorer 8 (more info)

source: Поддержка IE8
en: Support IE8

source: { block : 'page', title : 'Support IE8', head : [ { elem : 'conditional-comment', condition : '> IE 8', msieOnly : false, content : { elem : 'css', url : '_simple.css' } // стили для всех браузеров, в т.ч. IE9+ }, { elem : 'conditional-comment', condition : '<= IE 8', content : { elem : 'css', url : '_simple.ie.css' } // стили для IE8 и ниже } ], scripts : [ { elem : 'conditional-comment', condition : '< IE 9', content : { elem : 'js', url : '//yastatic.net/es5-shims/0.0.1/es5-shims.min.js' }, // Подключение es5-shim для IE8 и ниже }, { elem : 'js', url : '_simple.js' } ] }
en: { block : 'page', title : 'Support IE8', head : [ { elem : 'conditional-comment', condition : '> IE 8', msieOnly : false, content : { elem : 'css', url : '_simple.css' } // styles for all browsers, incl. IE9+ }, { elem : 'conditional-comment', condition : '<= IE 8', content : { elem : 'css', url : '_simple.ie.css' } // styles for IE8 and below } ], scripts : [ { elem : 'conditional-comment', condition : '< IE 9', content : { elem : 'js', url : '//yastatic.net/es5-shims/0.0.1/es5-shims.min.js' }, // Connecting es5-shim for IE8 and below }, { elem : 'js', url : '_simple.js' } ] }

source: Также вы можете это сделать на уровне шаблонов.
en: Also, you can do it on your template level.

source: История изменений доступна на отдельной странице.
en: You can check the changelog at the Changelog page.

source: Миграция на последующие версии будет описана на отдельной странице.
en: Check the migration details at the Migration page when available.

source: В основе всех принципов разработки bem-components лежит опыт работы нашей команды над другими библиотеками. Поэтому при разработке библиотеки мы старались взять все лучшее из прошлого, на его базе строить новое, и при этом не повторять прежних ошибок.
en: The base of all development principles of bem-components is the experience of our development team. For our library we take the best solutions from the past to create a new well-thought-out product called bem-components.

source: Проект open source
en: Open source project

source: Автоматизация
en: Automatization

source: При создании библиотеки мы автоматизировали все процессы, которые можно было автоматизировать: мы считаем, что разработчик не должен совершать повторяющиеся действия, для этого есть роботы.
en: We try to automize all possible processes: a developer should not perform repetitive actions, there are robots for this.

source: Библиотека разрабатывается с ориентацией на будущее: мы используем только последние версии браузеров и инструментов. Все это направлено на то, чтобы библиотека bem-components не теряла свою актуальность в процессе разработки.
en: We develop our library with a focus on the future: we supports only the latest browsers and tools. The library must not lose its relevance during the development process.

source: Оптимизация
en: Optimization

source: Решения по оптимизации внедряются непосредственно во время разработки кода каждого конкретного блока. Пути оптимизации продумываются заранее, чтобы избежать ситуаций, когда приходится оптимизировать уже написанный код.
en: We apply the optimization solutions for each block during the development to avoid the optimization of the already released code.

source: Поддержка нескольких тем
en: Muli-themes support

source: В библиотеке реализована одновременная поддержка нескольких тем. На данном этапе основной темой является тема islands, которая реализует новый дизайн сервисов Яндекса.
en: bem-components supports more then one theme simultaneously. For today the main theme of the library is islands. This theme implements the new Yandex design.

source: Сейчас в bem-components создан дополнительный служебный дизайн, представленный темой simple. Он разработан для проверки возможности сосуществования нескольких тем внутри одной библиотеки.
en: There is an additional temporary theme called simple in the library design. This theme was created to check the correct work of the library with more then one connected theme.

source: Селекторы в контексте темы
en: Selectors in a theme context

source: Библиотека предоставляет возможность создавать разные темы для блоков, а также подключать уже имеющиеся темы в любом количестве и сочетании на страницу. При этом есть возможность полностью отказаться от использования тем в своем проекте и получить привычные нативные браузерные контроллы, для которых уже написаны шаблоны и JavaScript-реализация.
en: The library allows you to use different themes within a one page of the project. Besides, you could use native controls of your browser, for this do not use theme design in your project.

source: Поддержка платформ
en: Platforms support

source: В библиотеке реализована поддержка разных платформ: desktop, touch (мобильные + планшеты). При этом блоки разработаны таким образом, чтобы реализация для одной платформы корректно отображалась и правильно себя вела и на другой.
en: The library supports the following platforms: desktop and touch (mobile + tablet). All blocks of the library work correct on all available platforms.

source: Для технически идентичных сервисов и проектов, которые используют тот же препроцессор и шаблонизатор, библиотека может поставляться в исходном виде — «source».
en: Used for the technically identical projects that use the same preprocessor and template engine.

source: Для сервисов и проектов, которые вообще не используют препроцессор или используют, но другой, существует возможность поставки скомпилированной версии библиотеки — «compiled».
en: Used for the projects that use any other preprocessor or do not use it at all.

source: Для возможности подключения библиотеки ссылками на страницу, по аналогии с jQuery или Bootstrap, предоставляется поставка в виде библиотеки — «library».
en: Used for the possibility to connect the library using links (like jQuery or Bootstrap).

source: Получаем исходники:
en: Get the source code:

source: Устанавливаем зависимости:
en: Install the dependencies:

source: Для последующего запуска локально установленных enb нам потребуется export PATH=./node_modules/.bin:$PATH или любой альтернативный способ.
en: You need export PATH=./node_modules/.bin:$PATH or any alternative way to run locally-installed enb .

source: Устанавливаем зависимые библиотеки:
en: Install all necessary libraries:

source: Собираем примеры и тесты:
en: Build and run tests and examples:

source: Запускаем сервер для разработки:
en: Run development server:

source: NB Возможность точечной сборки описана в разделе Тесты на шаблоны.
en: NB See Tests for templates for information on how to run tests for a specific block.

source: Проверяем стиль кода:
en: Check the coding style:

source: Определить, в какую версию проекта необходимо внести изменения.
en: Decide which version needs your changes.

source: Создать отдельную ветку с указанием номера issue и версии (issues/<номер issue>@v<номер версии>) на основе ветки версии. Например, для issue с номером 42 и версией 2: git checkout -b issues/42@v2. Если изменения нужно внести в несколько версий, то для каждой из версий создается отдельная ветка.
en: Create a feature branch with an issue number and a version (issues/<issue_number>@v<version_number>) based on a version branch. For example, for an issue #42 and a version 2: git checkout -b issues/42@v2. If you need changes for several versions, each of them has to have a feature branch.

source: Внести изменения. Для версии библиотеки bem-components v2, можно локально проверить, что ничего не сломалось, запустив npm test.
en: Create a feature branch with an issue number and a version (issues/<issue_number>@v<version_number>) based on a version branch. For example, for an issue #42 and a version 2: git checkout -b issues/42@v2. If you need changes for several versions, each of them has to have a feature branch.

source: Сделать коммит и отправить изменения в удаленный репозиторий (push). Если это необходимо, то нужно сделать rebase от базовой ветки версии.
en: Commit changes (you can test your changes running npm test) and push. Rebase your branch on a corresponding version branch if needed.

source: Создать pull request на основе созданной ветки. Для случая изменений в нескольких версиях необходимо создать pull request для каждой версии.
en: Create a pull request from your feature branch; or several pull requests if you changed several versions.

source: Ждать закрытия pull request и issue ;-)
en: Wait for your pull request and the issue closes ;-)

source: Чтобы запустить юнит-тесты на JS, используйте команду npm run test-specs. Кроме того, можно использовать точечную сборку, например, enb make specs desktop.specs/input.
en: To run JS unit tests use npm run test-specs command. You may also specify the target, e.g. enb make specs desktop.specs/input.

source: Для запуска тестов:
en: For tests execution you need the following:

source: Запустите утилиту sc (SauceConnect) и дождитесь, пока она поднимет туннель.
en: Run the sc utility (SauceConnect) and wait for a tunnel initialization.

source: Для сбора новых версий скриншотов используйте команду npm run gemini-gather.
en: To collect new versions of the screenshots use npm run gemini-gather.

source: Если вы разрабатываете новые тесты и хотите их запускать локально и быстрее, можно поднять свой собственный Selenium Server или phantomjs с WebDriver сервером. Для этого нужно:
en: In case you write new tests for local usage, you can run your own Selenium Server or PhantomJS with WebDriver server. For this:

source: Исправить в файле .gemini.yml опцию gridUrl на http://localhost:4444/.
en: Correct gridUrl option to http://localhost:4444/ in the .gemini.yml file.

source: Запустить тесты.
en: Run tests.

source: NB В репозиторий необходимо коммитить скриншоты, собранные в SauceLabs. Это позволит избежать даже незначительных отличий в отрисовке шрифтов.
en: NB You have to commit screenshots to the repository from SauceLabs to avoid minor differences in fonts rendering.

source: Внимательно проверить корректнотсь изображения. Если есть сомнения, используйте утилиту Araxis Merge или аналогичную, чтобы увидеть разницу между старой и новой версиями.
en: Check the validity. If in doubt, use Araxis Merge utility or something like this to see the difference between two versions of the pattern.

source: Чтобы добавить тест для блока, нужно в его директории на требуемом уровне переопределения создать каталог с названием [имя блока].tmpl-specs. Здесь будут храниться файлы тестов.
en: To add a test for a block, you need to add a directory named [block name].tmpl-specs on your definition level. All test files will be stored in it.

source: Каждый тест состоит из пары файлов в технологиях BEMJSON и HTML. Тестов и, соответственно, пар файлов у блока может быть несколько. Имена файлов произвольные, но они (не включая расширения) для каждого теста должны совпадать. Например, 10-default.bemjson.js и 10-default.html.
en: Each test consists of a pair of files implemented in following technologies: BEMJSON and HTML. Each block could have more then one pair of such files. You could give any name to the file. But the file names (without extensions) within the one pair for one test must coincide. For example, 10-default.bemjson.js and 10-default.html.

source: В BEMJSON-файле находится пример для блока, в HTML-файле – эталонный HTML-код, который должен получиться после применения шаблона блока к BEMJSON-у примера.
en: For each block BEMJSON file contains an example for a block, while HTML file contains standard HTML code – a block sample which is a block implementation result that becomes available after applying a template to the BEMJSON example.

source: Что это?
en: What is this?

source: Библиотека с открытым кодом, которая предоставляет набор готовых визуальных компонентов (блоков) для создания веб-интерфейсов.
en: BEM is an open-source library that provides a set of ready-made visual components (blocks) for creating web interfaces.

source: Библиотека предоставляет темы оформления. В данной версии представлена тема islands, реализующая новый дизайн Яндекса. Предусмотрена одновременная поддержка нескольких тем и возможность создания новых.
en: The library provides design themes. This version introduces the "islands" theme, which implements the new Yandex design. Features include supporting multiple themes at once, and creating new themes.

source: Содержание
en: Contents

source: Блоки
en: Blocks

source: Поддерживаемые браузеры
en: Supported browsers

source: Технологии
en: Technologies

source: Инструменты
en: Tools

source: Использование
en: Usage

source: Варианты поставки библиотеки
en: Library distributions

source: Разработка
en: Development

source: Команда основной разработки
en: Maintainers

source: Рабочий процесс
en: Workflow

source: Дополнительная информация
en: Additional information

source: Миграция на последующие версии
en: Migration to future versions

source: Уровни переопределения
en: Levels

source: common.blocks — поддержка всех устройств и браузеров.
en: common.blocks — support of any devices and browsers.

source: desktop.blocks — поддержка всех десктопных браузеров.
en: desktop.blocks — support of desktop browsers.

source: touch.blocks — реализация специфических особенностей для touch-платформ.
en: touch.blocks — implementation of specific features for touch platforms.

source: touch-phone.blocks — реализация специфических особенностей для смартфонов.
en: touch-phone.blocks — implementation of specific features for smartphones.

source: touch-pad.blocks — реализация специфических особенностей для планшетов.
en: touch-pad.blocks — implementation of specific features for tablets.

source: design/<common|desktop|touch|touch-phone|touch-pad>.blocks — реализация различных дизайнов (тем).
en: design/<common|desktop|touch|touch-phone|touch-pad>.blocks — implementation of various designs (themes).

source: Firefox (две последние стабильные версии)
en: Firefox (the last two stable versions)

source: Chrome (две последние стабильные версии)
en: Chrome (the last two stable versions)

source: Safari (две последние стабильные версии)
en: Safari (the last two stable versions)

source: Yandex (две последние стабильные версии)
en: Yandex(the last two stable versions)

source: Частичная поддержка Internet Explorer 8
en: Partial support for Internet Explorer 8

source: Поддержка Internet Explorer 8
en: Support for Internet Explorer 8

source: Для поддержки Internet Explorer 8 подключите на страницу:
en: To support Internet Explorer 8, you must add

source: файлы стилей с расширением *.ie.styl. Для этого укажите их в сборке (пример) и добавьте условные комментарии в блоке page (пример). Подключить стили для Internet Explorer 8 можно также на уровне шаблонов.
en: style files with the *.ie.styl extension to the page. To do this, specify them in the build config (see this example) and add comments in the page section (see this example). You can also enable styles for Internet Explorer 8 at the template level.

source: https://ru.bem.info/tools/bem/modules/
en: https://en.bem.info/tools/bem/modules/

source: https://ru.bem.info/technology/i-bem/current/i-bem-js/
en: https://en.bem.info/tutorials/bem-js-tutorial/

source: https://ru.bem.info/technology/bemhtml/current/reference/
en: https://en.bem.info/technology/bemhtml/current/reference/

source: https://ru.bem.info/technology/bh/current/about/
en: https://en.bem.info/technology/bh/current/about/

source: https://ru.bem.info/technology/deps/about/
en: https://en.bem.info/technology/deps/about/

source: Сборщики
en: Assemblers

source: https://ru.bem.info/tools/optimizers/borschik/
en: https://en.bem.info/tools/optimizers/borschik/

source: https://ru.bem.info/tools/optimizers/svgo/svgo/
en: https://en.bem.info/tools/optimizers/svgo/svgo/

source: Проверка кода
en: Code analysis

source: Прочее
en: Other

source: Autoprefixer — применяется во время сборки для генерации вендорных префиксов для поддерживаемых браузеров на основании конфигурации.
en: Autoprefixer — used during assembly to generate vendor prefixes for supported browsers based on the configuration.

source: Библиотека в проект подключается с помощью bem-tools или ENB. Укажите название и версию библиотеки в конфигурационном файле выбранного вами сборщика.
en: Use bem-tools or ENB to connect the library to the project. Specify the library name and version in the configuration file for your chosen assembly tool.

source: https://ru.bem.info/tutorials/project-stub/
en: https://en.bem.info/tutorials/project-stub/

source: При разработке проекта на основе project-stub библиотека подключена по умолчанию.
en: For projects developed on project-stub, the library is enabled by default.

source: Для технически идентичных сервисов и проектов, которые используют препроцессор и шаблонизатор, указанные в разделе Инструменты.
en: For technically identical services and projects that use a preprocessor and template engine listed in the Tools section.

source: Для сервисов и проектов, которые не используют препроцессор или используют отличный от указанного в разделе Инструменты.
en: For services and projects that do not use a preprocessor or use one that is not listed in the Tools section.

source: Для возможности подключения библиотеки ссылками на страницу, по аналогии с jQuery или Bootstrap.
en: To include the library by linking to a page, similar to jQuery or Bootstrap.

source: Для выбора этого варианта поставки необходимо выполнить npm run dist в корне библиотеки после установки npm-зависимостей. В результате бандлы сформируются в папке dist.
en: To choose this method, execute npm run dist in the library root after setting up npm dependencies. As a result, bundles are generated in the dist folder.

source: Рабочая копия
en: Working copy

source: Внесение изменений
en: How to contribute

source: Тестирование
en: Testing

source: Юнит-тесты на JavaScript
en: JavaScript unit tests

source: Регрессионное тестирование верстки
en: Regression tests for layout

source: Тесты на шаблоны
en: Tests for templates

source: Получение исходников:
en: Get sources:

source: Установка зависимостей (инструментов):
en: Install dependencies (of tools):

source: Для последующего запуска локально установленных инструментов потребуется export PATH=./node_modules/.bin:$PATH или любой альтернативный способ.
en: To then run locally installed tools, use export PATH=./node_modules/.bin:$PATH or any alternative method.

source: Установка зависимых библиотек:
en: Install dependent libraries:

source: Сборка примеров и тестов:
en: Build examples and tests:

source: Запуск сервера для разработки:
en: Start the development server:

source: NB Точечная сборка отдельных блоков описана в разделе Тесты на шаблоны.
en: Note: For information about assembling individual blocks, see the section Tests for templates.

source: Проверка кода:
en: Code analysis:

source: Определить версию библиотеки для внесения изменений.
en: Determine the library version to make changes to.

source: Создать отдельную ветку с указанием номера issue и версии (issues/<номер issue>@v<номер версии>) на основе ветки версии. Например, для issue с номером 42 и версией 2: git checkout -b issues/42@v2. Если изменения вносятся в несколько версий, то для каждой версии создается отдельная ветка.
en: Create a feature branch with the issue number and version (issues/<issue_number>@v<version_number>) based on a version branch. For example, for issue #42 and version 2: git checkout -b issues/42@v2. If you are making changes to multiple versions, each of them must have its own feature branch.

source: Внести изменения. Локально проверить результаты изменений на наличие ошибок можно, запустив npm test.
en: Make changes. To check the results of your changes locally for errors, run npm test.

source: Сделать коммит и отправить изменения в удаленный репозиторий. При необходимости, сделать rebase от базовой ветки версии.
en: Commit your changes and push them to the remote repository. If necessary, rebase your branch from the base version branch.

source: Создать pull request на основе созданной ветки. В случае изменений нескольких версий, создать pull request для каждой версии.
en: Create a pull request from your feature branch. If you changed multiple versions, create a pull request for each version.

source: Связать pull request и issue (например, c помощью комментария).
en: Link your pull request with an issue number (for example, leave a comment with the issue number).
